# 데이터프레임 생성

In [2]:
import numpy as np
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.1.1
2.2.3

- 첫번째 방법 : 리스트 활용
- 두번째 방법 : 딕셔너리 활용(강사 선호)

In [4]:
data = [
    ["039900", "알파코", 1000000, 10.05],
    ["039910", "A", 500000, 1.05],
    ["039920", "B", 1000, 1.28]
]

columns = ['종목코드', '종목명', '현재가', '등락률']
df = pd.DataFrame(data = data, columns = columns)
df

     종목코드  종목명      현재가    등락률
0  039900  알파코  1000000  10.05
1  039910    A   500000   1.05
2  039920    B     1000   1.28

In [61]:
data2 = {
    "종목코드" : ['039900', '0399910', '039920'],
    '종목명' : ['알파코', 'A', 'B']
}

df2 = pd.DataFrame(data = data2)
df2

      종목코드  종목명
0   039900  알파코
1  0399910    A
2   039920    B

In [62]:
import numpy as np
import random
import string

# 랜덤한 회사 이름 생성 함수 (2~10자의 알파벳으로 구성)
def random_company_name():
    length = random.randint(1, 10)  # 회사 이름의 길이 (1~10자)
    return ''.join(random.choices(string.ascii_uppercase, k=length))

# 10,000개의 가상 데이터 생성
data = []
for _ in range(10000):
    stock_code = ''.join(random.choices(string.digits, k=6))  # 6자리 숫자로 주식 코드 생성
    company_name = random_company_name()  # 회사 이름 생성
    price = random.randint(1000, 1000000)  # 주가 (1000 ~ 1000000)
    price_change = round(random.uniform(0, 30), 2)  # 주가 상승률 (0 ~ 30, 소수점 둘째 자리까지)
    data.append([stock_code, company_name, price, price_change])

# 생성된 데이터 확인
for i in range(5):  # 처음 5개 항목 출력
    print(data[i])

['973367', 'INUWLIF', 462799, 29.67]
['697303', 'MZG', 846324, 25.86]
['043197', 'ZUZ', 999671, 24.72]
['038356', 'EMBYBI', 452602, 29.27]
['717868', 'WY', 632994, 16.35]

In [63]:
import pandas as pd
import random
import string


# Regenerating the dictionary where each key (종목코드, 종목명, 현재가, 등락률) has a list of values

data_dict = {
    "종목코드": [],
    "종목명": [],
    "현재가": [],
    "등락률": []
}

# Function to generate simpler 종목코드 and 종목명 ensuring the 종목코드 starts with '0'
def generate_code_name_for_dict(existing_codes):
    while True:
        code = '0' + ''.join(random.choices(string.digits, k=5))  # Ensure it starts with '0'
        name = ''.join(random.choices(string.ascii_uppercase, k=2))  # Simpler 종목명 with 2 letters
        if code not in existing_codes:
            return code, name

# Generating 10,000 rows of data
existing_codes_for_dict = set()

for _ in range(10000):
    code, name = generate_code_name_for_dict(existing_codes_for_dict)
    existing_codes_for_dict.add(code)
    current_price = random.randint(1000, 1000000)  # Simpler current price
    change_rate = round(random.uniform(-5, 5), 2)  # Simpler change rate
    
    data_dict["종목코드"].append(code)
    data_dict["종목명"].append(name)
    data_dict["현재가"].append(current_price)
    data_dict["등락률"].append(change_rate)

# Previewing a portion of the dictionary
data_dict_preview = {k: data_dict[k][:5] for k in data_dict}

# data_dict_previw 로 기재하면 5개 조회
df2 = pd.DataFrame(data_dict_preview)
df2

     종목코드 종목명     현재가   등락률
0  003163  NH  777189  4.37
1  000159  UQ  542422 -1.01
2  088000  SW  943870 -3.40
3  079992  OV  490573 -1.62
4  085754  NS  202237 -1.34

In [64]:
# 데이터 상단부터 (n)개 조회
df2.head(2)

     종목코드 종목명     현재가   등락률
0  003163  NH  777189  4.37
1  000159  UQ  542422 -1.01

In [65]:
# 데이터 하단부터 (n)개 조회
df2.tail(1)

     종목코드 종목명     현재가   등락률
4  085754  NS  202237 -1.34

In [66]:
# 데이터 정보
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목코드    5 non-null      object
 1   종목명     5 non-null      object
 2   현재가     5 non-null      int64
 3   등락률     5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [67]:
# 여러 수치들 
df.describe()

                  현재가        등락률
count        3.000000   3.000000
mean    500333.333333   4.126667
std     499500.083417   5.131046
min       1000.000000   1.050000
25%     250500.000000   1.165000
50%     500000.000000   1.280000
75%     750000.000000   5.665000
max    1000000.000000  10.050000

In [68]:
data2 = {
    "종목코드" : ['039900', '039910', '039920'], 
    "종목명" : ["알파코", "A", "B"], 
    "현재가" : [10000000, 500000, 1000], 
    "등락률" : [10.05, 1.05, 1.28]
}

df2 = pd.DataFrame(data = data2)
df2

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [69]:
# 종목코드를 인덱스로 변경

df2 = df2.set_index("종목코드")
df2

        종목명       현재가    등락률
종목코드
039900  알파코  10000000  10.05
039910    A    500000   1.05
039920    B      1000   1.28

In [70]:
df2.reset_index()

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [72]:
df2.reset_index(drop=True) #df2.reset_index()

   종목명       현재가    등락률
0  알파코  10000000  10.05
1    A    500000   1.05
2    B      1000   1.28

In [74]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"] # 인덱스 설정
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [75]:
df.index.shape

(3,)

In [76]:
df.index

Index(['039900', '039910', '039900'], dtype='object')

In [77]:
df.values

array([['알파코', 10000000, 10.05],
       ['A', 500000, 1.05],
       ['B', 1000, 1.28]], dtype=object)

In [82]:
# 컬럼 조회 방법 2
df.현재가

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [79]:
# 컬럼 조회 방법 2
df['현재가']

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [84]:
# 위 방법과 클래스가 다르다 = 속성과 메서드가 다르다
df[['현재가']]

             현재가
039900  10000000
039910    500000
039900      1000